# Homebrew Packages

# dependenciee
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'imagemagick'
brew 'jq'
brew 'poppler'
brew 'ripgrep'
brew 'sevenzip'
brew 'zoxide'

# cli-essentials
brew 'bat'
brew 'eza'
brew 'fish'
brew 'fisher'
brew 'nvim'
brew 'oh-my-posh'
brew 'stow'
brew 'thefuck'
brew 'tldr'
brew 'tmux'
brew 'yazi'

# dev-essentials
brew 'commitizen'
brew 'git'
brew 'git-delta'
brew 'lazygit'
brew 'pipx'

# GUI-Applications
cask "chatgpt"
cask "discord"
cask "drawio"
cask "ghostty"
cask "microsoft-teams"
cask "nikitabobko/tap/aerospace"
cask "obsidian"
cask "parallels"
cask "sony-ps-remote-play"
cask "philips-hue-sync"
cask "proton-drive"
cask "proton-mail"
cask "proton-pass"
cask "protonvpn"
cask "telegram"
cask "visual-studio-code"
cask "zen-browser"

# Fonts
cask "font-caskaydia-cove-nerd-font"
cask "font-meslo-lg-nerd-font"
