# Homebrew Packages
brew 'bat'
brew 'eza'
brew 'fzf'
brew 'ffmpeg'
brew 'sevenzip'
brew 'jq'
brew 'poppler'
brew 'fd'
brew 'ripgrep'
brew 'imagemagick'
brew 'git'
brew 'gum'
brew 'lazygit'
brew 'pipx'
brew 'podman'
brew 'powerlevel10k'
brew 'thefuck'
brew 'tldr'
brew 'tmux'
brew 'zoxide'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'yazi'
brew 'stow'
brew 'fisher'


# GUI-Applications
cask "1password"
cask "arc"
cask "desktoppr"
cask "discord"
cask "drawio"
cask "ghostty"
cask "microsoft-teams"
cask "obsidian"
cask "onedrive"
cask "parallels"
cask "raycast"
cask "visual-studio-code"

# Fonts
cask "font-caskaydia-cove-nerd-font"
cask "font-meslo-lg-nerd-font"
